// @strict-types

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДополнительныеПараметры = ИнтеграцияСМаркетплейсамиКлиент.НовыеПараметрыОбработкиШтрихкода();
	
	Если ЗначениеЗаполнено(ПараметрыВыполненияКоманды.Параметры) Тогда
		ЗаполнитьЗначенияСвойств(ДополнительныеПараметры.ДанныеТорговойПлощадки, ПараметрыВыполненияКоманды.Параметры);
		ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, ПараметрыВыполненияКоманды.Параметры);
		
	ИначеЕсли ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("ФормаКлиентскогоПриложения")
			И ПараметрыВыполненияКоманды.Источник.ИмяФормы = "РегистрСведений.ЗаказыТорговыхПлощадок.Форма.ФормаСпискаЗаказов" Тогда
		
		Форма = ПараметрыВыполненияКоманды.Источник; // см. РегистрСведений.ЗаказыТорговыхПлощадок.Форма.ФормаСпискаЗаказов
		//@skip-check property-return-type
		ЗаполнитьЗначенияСвойств(ДополнительныеПараметры.ДанныеТорговойПлощадки, Форма.ДанныеТорговойПлощадки);
		ДополнительныеПараметры.КлючНазначенияФормы = "РаботаСПродажамиМП";
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("РучнойВводЗначенияПоискаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ВариантыПоиска = Новый Массив; // Массив из Строка
	ВариантыПоиска.Добавить(НСтр("ru = 'штрихкод печатной формы, сформированной в текущей учетной системе'"));
	ВариантыПоиска.Добавить(НСтр("ru = 'номер отправления торговой площадки'"));
	ВариантыПоиска.Добавить(НСтр("ru = 'штрихкод отправления торговой площадки'"));
	
	ВидМаркетплейса = ДополнительныеПараметры.ДанныеТорговойПлощадки.ВидМаркетплейса;
	
	Если ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоOzon(ВидМаркетплейса) Тогда
		ВариантыПоиска.Добавить(НСтр("ru = 'штрихкод возвратного отправления торговой площадки'"));
	ИначеЕсли ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоЯндексМаркет(ВидМаркетплейса) Тогда
		ВариантыПоиска.Добавить(НСтр("ru = 'номер отгрузки торговой площадки'"));
	КонецЕсли;
	
	ТекстПодсказкиВариантыПоиска = СтрСоединить(ВариантыПоиска, ";" + Символы.ПС + Символы.Таб + "- ");
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Подсказка", 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для поиска документа можно использовать:
			|	- %1.
			|
			|Введите значение поиска:'"),
		ТекстПодсказкиВариантыПоиска));
	
	ОткрытьФорму(
		"РегистрСведений.ЗаказыТорговыхПлощадок.Форма.ВводЗначенияПоиска",
		ПараметрыОткрытия, , , , ,
		Оповещение);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  Штрихкод - Строка
//  ДополнительныеПараметры - см. ИнтеграцияСМаркетплейсамиКлиент.НовыеПараметрыОбработкиШтрихкода
//
&НаКлиенте
Процедура РучнойВводЗначенияПоискаЗавершение(Штрихкод, ДополнительныеПараметры) Экспорт

	ОчиститьСообщения();
	
	Если Штрихкод = Неопределено Тогда
		Возврат;
	ИначеЕсли ПустаяСтрока(Штрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	Данные = ШтрихкодированиеНоменклатурыКлиент.СтруктураДанныхШтрихкода(Штрихкод, 0);
	Если Не ШтрихкодированиеНоменклатурыКлиент.ШтрихкодыВалидны(Данные) Тогда
		Возврат;
	КонецЕсли;
	
	Состояние(НСтр("ru = 'Выполняется поиск документа по штрихкоду...'"));
	
	Если ИнтеграцияСМаркетплейсамиКлиент.ШтрихкодОбработан(Штрихкод, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	ШтрихкодированиеПечатныхФормКлиент.ОбъектНеНайден(Штрихкод);

КонецПроцедуры

#КонецОбласти
